In [12]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/csv_data

# Sorting

## Sorting in SQL is the process of arranging the result set of a query in a specified order based on one or more columns. 
- ## The ORDER BY clause is used for sorting in SQL.
- ## It allows you to sort the result set in ascending (default) or descending order based on one or more columns.

<br>

## ORDER BY
- ## DESC / ASC
- ## on Multiple Columns Sorting
## LIMIT
- ## set the limit LIMIT N
- ## LIMIT x,y
- ## where x is offset (start) and y is no of rows (end)
- ## e.g LIMIT 5,5 means SKIP 5,START 6,7,8,9,10
- ## Understand Limit offset

In [2]:
result = %sql SELECT * FROM mobile
result.DataFrame().sample(3)

 * mysql+pymysql://root:***@localhost:3307/csv_data
352 rows affected.

,brand_name,model,price,rating,has_5g,has_nfc,has_ir_blaster,processor_brand,num_cores,processor_speed,...,refresh_rate,num_rear_cameras,num_front_cameras,os,primary_camera_rear,primary_camera_front,extended_memory_available,extended_upto,resolution_width,resolution_height
124,samsung,Samsung Galaxy A23 (8GB RAM + 128GB),19990,82.0,False,False,False,snapdragon,8.0,2.40,...,60,4,1.0,android,50.0,8.0,1,1024.0,1080,2408
314,xiaomi,Xiaomi Redmi Note 9,11989,75.0,False,False,True,helio,8.0,2.00,...,60,4,1.0,android,48.0,13.0,1,512.0,1080,2340
236,sony,Sony Xperia Ace IV,19990,80.0,False,True,False,snapdragon,8.0,2.00,...,120,2,1.0,android,50.0,16.0,1,1024.0,1080,2400

## Find top 5 samsung phones with biggest screen size

In [3]:
%%sql 
SELECT model,screen_size FROM mobile 
WHERE brand_name = "samsung" 
ORDER BY screen_size DESC 
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('Samsung Galaxy Note 10 Plus', Decimal('6.80')),
 ('Samsung Galaxy A83 5G', Decimal('6.71')),
 ('Samsung Galaxy A82 5G', Decimal('6.71')),
 ('Samsung Galaxy M53 5G', Decimal('6.70')),
 ('Samsung Galaxy A71', Decimal('6.70'))]

## Sort Top 5 phones in decending orders of numbers of total cameras

In [5]:
%%sql 
SELECT model,num_front_cameras + num_rear_cameras AS "camera" FROM mobile 
ORDER BY camera DESC 
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('Vivo V19 (8GB RAM + 256GB)', Decimal('6.0')),
 ('OPPO F17 Pro', Decimal('6.0')),
 ('Realme 6 Pro', Decimal('6.0')),
 ('Xiaomi Redmi Note 10S', Decimal('5.0')),
 ('Xiaomi Redmi Note 11', Decimal('5.0'))]

## Sort data on basis of ppi in descending Order

In [7]:
%%sql
SELECT model,ROUND(SQRT((resolution_width*resolution_width)+(resolution_height*resolution_height)/screen_size)) AS "ppi" FROM mobile
ORDER BY ppi DESC
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('Samsung Galaxy F13', 2444.0),
 ('Samsung Galaxy F13 (4GB RAM + 128GB)', 2444.0),
 ('Infinix Note 12', 2436.0),
 ('Xiaomi 11i HyperCharge 5G', 2436.0),
 ('Xiaomi Mi 11i 5G', 2436.0)]

## Find the phone with 2nd largest battery

In [8]:
%%sql

SELECT model,battery_capacity FROM mobile
ORDER BY battery_capacity DESC
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/csv_data
10 rows affected.

[('Doogee V Max', Decimal('22000.0')),
 ('Tecno Pova 2', Decimal('7000.0')),
 ('Tecno Pova 3', Decimal('7000.0')),
 ('Samsung Galaxy F63', Decimal('7000.0')),
 ('Tecno Pova 3 (6GB RAM + 128GB)', Decimal('7000.0')),
 ('Samsung Galaxy M54 5G', Decimal('6000.0')),
 ('Samsung Galaxy M33 5G (8GB RAM + 128GB)', Decimal('6000.0')),
 ('Xiaomi Redmi 10', Decimal('6000.0')),
 ('Samsung Galaxy M13', Decimal('6000.0')),
 ('Tecno Pova 4', Decimal('6000.0'))]

In [9]:
%%sql
SELECT model,battery_capacity FROM mobile
ORDER BY battery_capacity DESC
LIMIT 3,3

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('Tecno Pova 3 (6GB RAM + 128GB)', Decimal('7000.0')),
 ('Tecno Pova 2', Decimal('7000.0')),
 ('Xiaomi Redmi 10', Decimal('6000.0'))]

## Understand LIMIT offset

In [44]:
%%sql 
SELECT * FROM csv_data.limits

 * mysql+pymysql://root:***@localhost:3307/csv_data
20 rows affected.

[(1,),
 (2,),
 (3,),
 (4,),
 (5,),
 (6,),
 (7,),
 (8,),
 (9,),
 (10,),
 (11,),
 (12,),
 (13,),
 (14,),
 (15,),
 (16,),
 (17,),
 (18,),
 (19,),
 (20,)]

In [45]:
%%sql 
SELECT * FROM csv_data.limits
LIMIT 5,3 # that means i want 3 rows and rows start from 6

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(6,), (7,), (8,)]

## Now Find the phone with 2nd largest battery

In [50]:
%%sql
SELECT model,battery_capacity FROM mobile
ORDER BY battery_capacity DESC

LIMIT 1,1 # means i need 1 row and row are start with 2nd

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Tecno Pova 3 (6GB RAM + 128GB)', Decimal('7000.0'))]

### LIMIT total no of rows required , Start N + 1
<br>

## Find the name and rating of the worst rated samsung phones

In [63]:
%%sql

SELECT model , rating,brand_name FROM mobile 
WHERE brand_name = "samsung"
ORDER BY rating ASC 
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Samsung Galaxy M04', Decimal('66.0'), 'samsung')]

## Sort phones aplhabetically and then on the basis of rating in DESC order

### Sort on Multiple Columns

In [71]:
%%sql 
SELECT brand_name,model,price FROM mobile
ORDER BY 
brand_name DESC, 
price DESC
LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('xiaomi', 'Xiaomi Redmi Note 12 Pro Max 5G', 32999),
 ('xiaomi', 'Xiaomi 11i HyperCharge 5G (8GB RAM + 128GB)', 26999),
 ('xiaomi', 'Xiaomi Redmi Note 12 Explorer', 24999)]

<hr><br>

# Grouping
- ### Grouping in SQL refers to the process of grouping rows in a table based on the values in one or more columns.
- ### It is often used in conjunction with aggregate functions, such as COUNT, SUM, AVG, MAX, or MIN, to perform calculations on each group of rows.
<br>

- ## Group by on Single Column
- ## Group by on Multiple Column

<br><br>

##  Group smartphones by brand and get count, average price, max rating,avg screen size  and avg batery  capacity

In [98]:
%%sql
SELECT brand_name, COUNT(*) AS "num_of_brands" FROM mobile
GROUP BY brand_name
ORDER BY num_of_brands DESC

 * mysql+pymysql://root:***@localhost:3307/csv_data
21 rows affected.

[('xiaomi', 66),
 ('samsung', 66),
 ('realme', 52),
 ('vivo', 34),
 ('oppo', 29),
 ('poco', 22),
 ('infinix', 20),
 ('motorola', 19),
 ('tecno', 10),
 ('iqoo', 9),
 ('oneplus', 8),
 ('nokia', 6),
 ('doogee', 2),
 ('huawei', 2),
 ('lava', 1),
 ('cola', 1),
 ('itel', 1),
 ('redmi', 1),
 ('honor', 1),
 ('jio', 1),
 ('sony', 1)]

### Now get the averages

In [113]:
%%sql
SELECT 

brand_name, 
COUNT(*) AS "num_of_brands",
ROUND(AVG(price)) AS "avg_price",
MAX(rating) AS "max_rating",
ROUND(AVG(screen_size)) AS "avg_screen_size",
ROUND(AVG(battery_capacity)) AS "avg_battery_capacity"

FROM mobile

GROUP BY brand_name
ORDER BY avg_battery_capacity DESC,avg_price ASC

 * mysql+pymysql://root:***@localhost:3307/csv_data
21 rows affected.

[('doogee', 2, Decimal('30499'), Decimal('88.0'), Decimal('6'), Decimal('14000')),
 ('tecno', 10, Decimal('13354'), Decimal('84.0'), Decimal('7'), Decimal('6000')),
 ('poco', 22, Decimal('13843'), Decimal('84.0'), Decimal('7'), Decimal('5095')),
 ('xiaomi', 66, Decimal('15810'), Decimal('89.0'), Decimal('7'), Decimal('5081')),
 ('samsung', 66, Decimal('23368'), Decimal('89.0'), Decimal('7'), Decimal('5076')),
 ('infinix', 20, Decimal('15159'), Decimal('87.0'), Decimal('7'), Decimal('5075')),
 ('motorola', 19, Decimal('14655'), Decimal('87.0'), Decimal('7'), Decimal('5053')),
 ('itel', 1, Decimal('6699'), Decimal('61.0'), Decimal('7'), Decimal('5000')),
 ('jio', 1, Decimal('11990'), Decimal('64.0'), Decimal('7'), Decimal('5000')),
 ('honor', 1, Decimal('14990'), Decimal('75.0'), Decimal('7'), Decimal('5000')),
 ('cola', 1, Decimal('14999'), Decimal('74.0'), Decimal('6'), Decimal('5000')),
 ('iqoo', 9, Decimal('16768'), Decimal('82.0'), Decimal('7'), Decimal('5000')),
 ('lava', 1, Decimal('17990'), Decimal('84.0'), Decimal('7'), Decimal('5000')),
 ('redmi', 1, Decimal('18999'), Decimal('81.0'), Decimal('7'), Decimal('5000')),
 ('sony', 1, Decimal('19990'), Decimal('80.0'), Decimal('7'), Decimal('5000')),
 ('realme', 52, Decimal('15544'), Decimal('85.0'), Decimal('7'), Decimal('4983')),
 ('oneplus', 8, Decimal('21321'), Decimal('85.0'), Decimal('7'), Decimal('4850')),
 ('vivo', 34, Decimal('19081'), Decimal('86.0'), Decimal('7'), Decimal('4834')),
 ('nokia', 6, Decimal('17579'), Decimal('85.0'), Decimal('7'), Decimal('4803')),
 ('oppo', 29, Decimal('20791'), Decimal('87.0'), Decimal('7'), Decimal('4698')),
 ('huawei', 2, Decimal('130995'), Decimal('81.0'), Decimal('7'), Decimal('4450'))]

##  Group smartphones by whether they have  and NFC and get the avg price and rating

In [141]:
%%sql
SELECT

has_nfc,
ROUND(AVG(price)) AS "avg_price",
ROUND(AVG(rating)) AS "avg_rating"

FROM mobile

GROUP BY has_nfc

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[('False', Decimal('16204'), Decimal('77')),
 ('True', Decimal('31625'), Decimal('83'))]

## Group on phones by the brand_name and processor and get  the count of models and avg primary camera resolution

In [162]:
%%sql

SELECT brand_name,processor_brand,

COUNT(model) AS "total_model",
ROUND(AVG(primary_camera_rear)) AS "avg_primary_camera"

FROM mobile
GROUP BY brand_name, processor_brand

 * mysql+pymysql://root:***@localhost:3307/csv_data
46 rows affected.

[('cola', 'helio', 1, Decimal('50')),
 ('doogee', 'dimensity', 1, Decimal('108')),
 ('doogee', 'helio', 1, Decimal('108')),
 ('honor', 'snapdragon', 1, Decimal('48')),
 ('huawei', 'kirin', 1, Decimal('48')),
 ('huawei', 'snapdragon', 1, Decimal('50')),
 ('infinix', 'dimensity', 5, Decimal('62')),
 ('infinix', 'helio', 12, Decimal('71')),
 ('infinix', 'tiger', 3, Decimal('38')),
 ('iqoo', 'snapdragon', 9, Decimal('50')),
 ('itel', 'unisoc', 1, Decimal('8')),
 ('jio', 'snapdragon', 1, Decimal('13')),
 ('lava', 'dimensity', 1, Decimal('64')),
 ('motorola', 'dimensity', 1, Decimal('108')),
 ('motorola', 'helio', 8, Decimal('41')),
 ('motorola', 'snapdragon', 9, Decimal('59')),
 ('motorola', 'tiger', 1, Decimal('13')),
 ('nokia', 'snapdragon', 2, Decimal('49')),
 ('nokia', 'unisoc', 4, Decimal('41')),
 ('oneplus', 'snapdragon', 8, Decimal('59')),
 ('oppo', 'dimensity', 6, Decimal('45')),
 ('oppo', 'helio', 5, Decimal('49')),
 ('oppo', 'snapdragon', 18, Decimal('64')),
 ('poco', 'dimensity', 9, Decimal('56')),
 ('poco', 'helio', 7, Decimal('45')),
 ('poco', 'snapdragon', 6, Decimal('59')),
 ('realme', 'dimensity', 17, Decimal('50')),
 ('realme', 'helio', 11, Decimal('54')),
 ('realme', 'snapdragon', 15, Decimal('71')),
 ('realme', 'tiger', 8, Decimal('40')),
 ('realme', 'unisoc', 1, Decimal('8')),
 ('redmi', 'snapdragon', 1, Decimal('108')),
 ('samsung', 'dimensity', 9, Decimal('67')),
 ('samsung', 'exynos', 31, Decimal('46')),
 ('samsung', 'helio', 11, Decimal('44')),
 ('samsung', 'snapdragon', 13, Decimal('56')),
 ('samsung', 'unisoc', 2, Decimal('48')),
 ('sony', 'snapdragon', 1, Decimal('50')),
 ('tecno', 'dimensity', 2, Decimal('50')),
 ('tecno', 'helio', 8, Decimal('49')),
 ('vivo', 'dimensity', 4, Decimal('48')),
 ('vivo', 'helio', 9, Decimal('40')),
 ('vivo', 'snapdragon', 21, Decimal('48')),
 ('xiaomi', 'dimensity', 17, Decimal('72')),
 ('xiaomi', 'helio', 19, Decimal('57')),
 ('xiaomi', 'snapdragon', 30, Decimal('65'))]

## FIND TOP 5 most costly phones

In [170]:
%%sql

SELECT brand_name, ROUND(AVG(price)) AS "avg_price" FROM mobile

GROUP BY brand_name
ORDER BY avg_price DESC

LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('huawei', Decimal('130995')),
 ('doogee', Decimal('30499')),
 ('samsung', Decimal('23368')),
 ('oneplus', Decimal('21321')),
 ('oppo', Decimal('20791'))]

## Find the smallest screen size smartphones

In [186]:
%%sql

SELECT brand_name, ROUND(AVG(screen_size)) AS "avg_screensize" FROM mobile

GROUP BY brand_name
ORDER BY avg_screensize ASC
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('doogee', Decimal('6'))]

## Group smartphones by the brand and find the brand  with  the highest  no of models that have both NFC and and IR blaster

In [220]:
%%sql

SELECT brand_name, COUNT(*) AS "count" FROM mobile

WHERE has_nfc = "True" AND has_nfc ="True"

GROUP BY brand_name
ORDER BY count DESC

LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('samsung', 25)]

<hr><br>

## HAVING

- ### HAVING clause is used in conjunction with the GROUP BY clause to filter the results of a query based on aggregate conditions.
- ### It is similar to the WHERE clause but is specifically designed for conditions on grouped data.

<br>

## Find the average rating of smartphones brand which have more than 40 Phones

In [205]:
%%sql

SELECT brand_name, 
ROUND(AVG(rating)) AS "avg_rating",
COUNT(*) AS "count"

FROM mobile

GROUP BY brand_name HAVING count > 40

ORDER BY avg_rating DESC

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('samsung', Decimal('79'), 66),
 ('xiaomi', Decimal('78'), 66),
 ('realme', Decimal('77'), 52)]

## Find the top 3 brand which the highest avg ram that have refresh rate of atleast 90 Hz and fast charging available and dont consider brands which have less than  10 phones

In [255]:
%%sql 

SELECT 

brand_name,fast_charging_available,refresh_rate,
ROUND(AVG(ram_capacity)) AS "ram_capacity"

FROM mobile WHERE refresh_rate > 90 AND fast_charging_available = 1
GROUP BY brand_name HAVING COUNT(*) > 10
ORDER BY ram_capacity DESC
LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('samsung', 1, 120, Decimal('7')),
 ('realme', 1, 120, Decimal('6')),
 ('xiaomi', 1, 120, Decimal('6'))]

## Find the avg price all the phone brands with avg rating > 70 and num_phones more than 10 among all 5g enable phones

In [285]:
%%sql

SELECT brand_name,
ROUND(AVG(price)) AS "avg_price",
has_5g FROM mobile WHERE has_5g = "True"

GROUP BY brand_name HAVING COUNT(*) > 10 AND ROUND(AVG(rating)) > 70  
ORDER BY avg_price DESC

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[('samsung', Decimal('27342'), 'True'),
 ('oppo', Decimal('23713'), 'True'),
 ('vivo', Decimal('22812'), 'True'),
 ('xiaomi', Decimal('19452'), 'True'),
 ('realme', Decimal('18185'), 'True'),
 ('poco', Decimal('15356'), 'True')]